In [2]:
import numpy as np
import pandas as pd

print("NumPy:", np.__version__)
print("pandas:", pd.__version__)

NumPy: 2.4.1
pandas: 2.3.3

In [3]:
arr = np.array([1, 3, 5, 7, 9])
print(arr)
print(type(arr))  # <class 'numpy.ndarray'>

[1 3 5 7 9]
<class 'numpy.ndarray'>

In [4]:
mean_val = arr.mean()          # or np.mean(arr)
max_val = arr.max()            # or np.max(arr)
std_val = arr.std()            # or np.std(arr)

print("Mean:", mean_val)
print("Max:", max_val)
print("Std:", std_val)

Mean: 5.0
Max: 9
Std: 2.8284271247461903

In [5]:
data = {
    "student": ["Ahmed", "Sara", "Omar", "Laila"],
    "score":   [85, 92, 78, 90],
    "age":     [21, 22, 20, 23]
}

df = pd.DataFrame(data)
print(df)

  student  score  age
0   Ahmed     85   21
1    Sara     92   22
2    Omar     78   20
3   Laila     90   23

In [11]:

avg_score = df.score.mean()
print("Average score:", avg_score)
df.describe()

Average score: 86.25

           score        age
count   4.000000   4.000000
mean   86.250000  21.500000
std     6.238322   1.290994
min    78.000000  20.000000
25%    83.250000  20.750000
50%    87.500000  21.500000
75%    90.500000  22.250000
max    92.000000  23.000000

In [7]:
df.head()          # first 5 rows

  student  score  age
0   Ahmed     85   21
1    Sara     92   22
2    Omar     78   20
3   Laila     90   23